[
    {
        "name": "Methi Aloo Paratha",
        "ingredients": [
            "Fenugreek leaves (Methi) - washed, dried, and roughly cut",
            "Wheat flour",
            "Salt to taste",
            "Water",
            "Oil",
            "Whole coriander seeds",
            "Cumin seeds",
            "Boiled potatoes - mashed",
            "Finely chopped green chilies",
            "Grated ginger",
            "Red chili powder",
            "Coriander powder",
            "Chaat masala (optional) or dry mango powder",
            "Freshly chopped green coriander",
            "Dry flour for dusting while rolling"
        ],
        "instructions": [
            "Wash the fenugreek leaves and dry them under a fan. Roughly cut them. Heat the fenugreek slightly to wilt and shrink it.",
            "Mix the fenugreek leaves with wheat flour. Add salt to taste.",
            "Add water slowly to knead a tight dough. Add water little by little to avoid spilling.",
            "Play with the dough by adding dry flour and water as needed while kneading.",
            "Once the dough is ready, apply a little oil on your hands and coat the dough with it. Let it rest for 10–15 minutes.",
            "For the stuffing, take whole coriander seeds and cumin seeds. Coarsely grind them using a mortar and pestle.",
            "Mash the boiled potatoes with your hands. Add the coarsely ground cumin and coriander, finely chopped green chilies, grated ginger, red chili powder, coriander powder, and chaat masala (optional).",
            "Add freshly chopped green coriander and salt to taste. Mix everything thoroughly.",
            "Divide the dough into equal-sized portions and roll them into pedas.",
            "Flatten the pedas lightly and shape them into bowls. Stuff each peda with the potato mixture.",
            "Close the edges of the pedas, seal them, and shape them into round stuffed balls. Cover them with a wet cloth and let them rest for 10 minutes.",
            "Dust the rolling board with dry flour and gently roll out stuffed pedas into parathas of your desired size and shape.",
            "Heat a tawa and place the rolled paratha on it. Flip it to cook the other side.",
            "Spread oil or ghee on both sides of the paratha while cooking. Flip until golden brown and puffed.",
            "Make sure the parathas are fully cooked inside. If they don’t puff, it might be due to a small gap while sealing, but the paratha will still cook well."
        ]
    },
    {
        "name": "Radish Raita",
        "ingredients": [
            "Radish leaves - finely chopped",
            "Radish - grated",
            "Salt",
            "Thick yogurt (curd)",
            "Black salt",
            "Black pepper",
            "Roasted and crushed cumin",
            "Finely chopped green chili (optional)"
        ],
        "instructions": [
            "Separate the radish leaves from the stalk and finely chop them.",
            "Add salt to the radish leaves to release their water and reduce their volume.",
            "Grate the radish using the thick side of the grater for a bite. Combine the grated radish with the salted leaves.",
            "Let the mixture rest for 3–4 minutes to release water. Squeeze out the water from the radish and leaves.",
            "In a bowl, mix thick yogurt (curd) with salt, black salt, black pepper, roasted and crushed cumin, and finely chopped green chili (optional).",
            "Add the prepared radish and leaves to the yogurt mixture and mix well.",
            "The radish raita is ready to serve."
        ]
    }
]