[
    {
        "name": "Baked Khichdi",
        "ingredients": [
            "Desi Ghee",
            "Mustard Seeds",
            "Cumin Seeds",
            "Roughly cut Red Onions",
            "Green Peas (fresh or frozen)",
            "Carrots (or any vegetables like French Beans, Cauliflower, Cabbage, etc.)",
            "Crushed Ginger-Garlic",
            "Green Chillies",
            "Asafoetida",
            "Red Chilli Powder",
            "Turmeric Powder",
            "Salt",
            "Short-Grain Rice (washed and dried)",
            "Split Green Gram (with its skin on)",
            "Water",
            "Mango Pickle (scoop full)",
            "Lime (half, seeds removed)",
            "Hung Curd (alternatively, Pizza Cheese, Mozzarella Cheese, or Processed Cheese)",
            "Oil",
            "Curry Leaves",
            "Dried Red Chillies"
        ],
        "instructions": [
            "In a pressure cooker, heat Ghee (Desi Ghee).",
            "Once the Ghee heats up, begin with the tempering by adding Mustard Seeds and Cumin Seeds.",
            "Add roughly cut Red Onions and sauté.",
            "Add vegetables such as Green Peas (fresh or frozen) and Carrots. You can also add French Beans, Cauliflower, or Cabbage based on your choice.",
            "Give the mixture a quick mix and sauté slightly.",
            "Add crushed Ginger-Garlic and Green Chillies.",
            "Add Powder Spices: Asafoetida, Red Chilli Powder, Turmeric Powder, and Salt.",
            "Add Short-Grain Rice (washed once and dried completely) and Split Green Gram (with its skin on for nutrient value).",
            "Sauté the rice and gram mixture on high flame for a while.",
            "Add water and give the mixture a good mix.",
            "Add a scoop full of Mango Pickle and squeeze in half a Lime (ensure seeds are removed).",
            "Give a quick mix, lower the flame, and pressure cook the Khichdi for 3 whistles or on slow flame for 15 to 20 minutes.",
            "Turn off the flame and allow the pressure in the cooker to subside completely.",
            "Once the pressure has settled, open the cooker and give the Khichdi a good mix.",
            "Move the Khichdi into a baking dish and flatten it down evenly.",
            "Top the Khichdi with Hung Curd. Spread it evenly using a clean spatula or palette knife. (Alternatively, you can use grated Pizza Cheese, Mozzarella Cheese, or Processed Cheese.)",
            "Bake the dish in a preheated oven at 200 degrees Celsius for 10 minutes.",
            "Prepare a tempering by heating Oil in a pan. Add Mustard Seeds, Cumin Seeds, Curry Leaves, and Dried Red Chillies.",
            "Pour the tempering over the baked Khichdi.",
            "Serve the baked Khichdi to family and friends. Enjoy and let the chef know how they liked it!"
        ]
    }
]