[
    {
        "name": "Bread Onion Roll",
        "ingredients": [
            "Untoasted Gram Flour",
            "Salt",
            "Carom Seeds",
            "Red Chilli Powder",
            "Water",
            "Red Onions",
            "Fresh Bread Slices",
            "Spicy Green Chutney",
            "Schezwan Chutney",
            "Mozzarella Cheese (or any Cheese of your choice, such as Processed Cheese)",
            "Toothpicks",
            "Oil for frying"
        ],
        "instructions": [
            "Begin with preparing the batter: Take Untoasted Gram Flour in a bowl. Add Salt, Carom Seeds, and Red Chilli Powder.",
            "Add Water to the Gram Flour mixture and whip it up into a lump-free batter. The batter should have a thick, cake-like or Zabayan consistency. Set this aside.",
            "Slice a couple of Red Onions and crush them gently using your hands. Add these crushed Onions into the prepared batter. Ensure the batter is lump-free before adding the Onions.",
            "Mix the batter and Onions thoroughly, scraping the sides of the bowl as needed.",
            "Take a slice of fresh Bread and press it flat using a rolling pin. This step increases the surface area of the Bread. Repeat the same for the remaining slices.",
            "Apply Spicy Green Chutney onto one of the flattened Bread slices. Spread it evenly with the help of a spatula or butter knife.",
            "On the next three slices of Bread, apply Schezwan Chutney as an additional surprise. Spread it evenly.",
            "Add some Mozzarella Cheese (or any Cheese of your choice) over the Chutney-spread Bread slices.",
            "Roll these Bread slices tightly into a pinwheel shape and secure them with the help of a toothpick.",
            "Once all the Chutney Cheese and Schezwan Cheese Pinwheels are prepared and secured with toothpicks, carefully remove the toothpicks.",
            "Dip each rolled Bread slice into the prepared batter. Roll it once or twice to ensure the batter coats the Bread Roll evenly.",
            "Fry the batter-coated Bread Rolls in hot Oil until golden and crisp.",
            "Transfer the fried Bread Onion Rolls onto an absorbent tissue paper to remove excess Oil.",
            "Repeat the process for the remaining rolls.",
            "Serve the Bread Onion Rolls hot. Enjoy this delightful combination of Bread Pakoda and Kanda Bhaji with your family and friends in any season!"
        ]
    }
]