[
    {
        "name": "Broccoli Paneer Soup",
        "ingredients": [
            "Red Onion",
            "Spring Onion Whites",
            "Butter",
            "Garlic (a couple of cloves)",
            "Green Chillies",
            "Broccoli",
            "Water or Stock",
            "Salt",
            "Processed Cheese",
            "Spring Onion Greens",
            "Paneer"
        ],
        "instructions": [
            "Begin with a Red Onion and Spring Onion Whites. Snip the greens off and keep them aside. Roughly cut the onions for their wonderful sweetness in the soup.",
            "Heat a touch of Butter in a pan and slide in the Red and White Onions.",
            "Add a couple of cloves of Garlic. Make sure not to make the soup overly garlicky.",
            "Add Green Chillies for the spice quotient. Snip them off and stir quickly.",
            "Cook the mixture on medium to low flame for a couple of minutes.",
            "Cut the Broccoli roughly. Keep the stalk aside for stock or stir-fry if desired. Ensure the Broccoli is picked and washed.",
            "Slide the Broccoli florets into the pan and stir for a couple of seconds until the color changes due to the heat.",
            "Add water or stock to the pan. In this case, water is used.",
            "Season with a touch of Salt.",
            "Add pieces of Processed Cheese for creaminess. No need to waste time grating or chopping the cheese.",
            "Add some Spring Onion Greens.",
            "Allow the mixture to simmer for 15 to 20 minutes. Do not cover the pan to avoid discoloration of the soup.",
            "For extra creaminess, add a few pieces of Paneer, keeping some aside for garnish. This enhances the taste, texture, and flavor of the soup.",
            "Mix everything and cook for another 2 minutes until the Broccoli is done.",
            "Blend the mixture into a puree. You can make it nice and fine like any cream soup, or keep it wholesome with chunks of Paneer, Cheese, and Broccoli. Straining is optional, depending on your preference.",
            "Serve immediately and enjoy your creamy, hearty, and wholesome Broccoli Paneer Soup. Perfect for winter!"
        ]
    }
]