[
    {
        "name": "Broccoli Clear Soup",
        "ingredients": [
            "3 cups of water",
            "Broccoli stock",
            "1 Onion, chopped",
            "4-5 cloves of Garlic",
            "1 Tomato, chopped",
            "1 stick of Cinnamon",
            "1 Clove",
            "1 Bay Leaf",
            "A big pinch of Salt",
            "1 tbsp Butter",
            "1 small Onion, finely chopped",
            "1 tbsp Garlic, finely chopped",
            "1 tbsp Celery, finely chopped",
            "1 cup of Broccoli Florets",
            "1 cup of Zucchini, finely chopped",
            "1 cup of Carrot, finely chopped",
            "Spinach Leaves (a few, properly washed)",
            "1 tsp Oregano",
            "A big pinch of Chilli Flakes",
            "Pepper to taste",
            "Little more Salt",
            "Basil Leaves (a few, torn)"
        ],
        "instructions": [
            "Take 3 cups of water.",
            "Add the following ingredients into the water to make the stock: Broccoli stock, 1 chopped Onion, 4-5 cloves of Garlic, 1 chopped Tomato, 1 stick of Cinnamon, 1 Clove, 1 Bay Leaf, and a big pinch of Salt.",
            "Bring all these ingredients to a boil.",
            "Boil the stock for at least a good 8-10 minutes.",
            "Heat a tablespoon of Butter in a pan.",
            "Add 1 small Onion (finely chopped), 1 tablespoon of Garlic (finely chopped), and 1 tablespoon of Celery (finely chopped).",
            "Saute all these ingredients till they are nice and soft.",
            "Add 1 cup of Broccoli Florets, 1 cup of Zucchini (finely chopped), 1 cup of Carrot (finely chopped), and a few Spinach Leaves (torn and properly washed).",
            "Cook the vegetables for 2-3 minutes.",
            "Turn off the flame for the stock and strain it using a fine sieve.",
            "Add the strained stock to the sauteed vegetables. Only use the water from the stock.",
            "Bring the soup to a boil for around 2 minutes.",
            "Season the soup with the following: 1 teaspoon of Oregano, a big pinch of Chilli Flakes, Pepper to taste, a little more Salt, and a few torn Basil Leaves.",
            "Give the soup a good mix and bring it to a boil.",
            "Once the soup is ready, turn off the flame and pour it into a bowl.",
            "The soup has very minimal flavors and is hearty, which will open up all your senses. The chef suggests you give it a try!"
        ]
    }
]