[
    {
        "name": "Cheesy Aloo Tikki Burger",
        "ingredients": [
            "Potatoes (boiled, peeled, mashed)",
            "Onions (finely chopped, optional sautéed)",
            "Herbs (Oregano, Thyme, Rosemary, Sage - or any fresh herb of choice)",
            "Garam Masala Powder (or Curry Spice/Curry Powder as an alternative)",
            "Red Chilli Powder",
            "Salt (adjust with caution if already added while boiling potatoes)",
            "Bread Crumbs",
            "Grated Processed Cheese",
            "Burger Buns",
            "Butter",
            "Mayonnaise",
            "Lettuce (crisp)",
            "Onion Rings"
        ],
        "instructions": [
            "Boil, peel, and mash the potatoes. Keep them ready for use.",
            "To the mashed potatoes, add finely chopped onions. Alternatively, you can slightly sauté the onions to avoid rawness. Note: The onions won’t remain raw since the tikkis will be cooked later.",
            "Add a combination of herbs (Oregano, Thyme, Rosemary, Sage) or any single fresh herb of choice.",
            "Add Garam Masala Powder. If unavailable, use Curry Spice or Curry Powder as a substitute.",
            "Add Red Chilli Powder and a touch of Salt. Be cautious with salt if it was already added while boiling the potatoes.",
            "Mix in Bread Crumbs and Grated Processed Cheese. Mix well to form the Aloo Tikki mixture.",
            "Scoop out orange-sized balls from the mixture and pat them into the shape of a tikki or cutlet. Ensure the size of the tikki matches the size of your burger bun, either slightly smaller or larger but not tiny.",
            "Once the tikkis are shaped, coat them lightly with Bread Crumbs. The goal is to create a crumbly exterior, not a thick crust like you would for Paneer Popcorns or Nuggets.",
            "Dust off any loose crumbs from the tikkis.",
            "Heat a pan and add oil. You can choose to pan fry with very little oil or deep fry the tikkis.",
            "Once the oil heats up, pick a tikki gently, dust away any loose crumbs, and fry on high flame.",
            "Flip the tikki carefully once it is crisp and golden fried at the bottom. Fry the other side similarly.",
            "Transfer the fried tikkis onto an absorbent tissue paper to remove excess oil.",
            "For assembly, take a burger bun and slice it horizontally.",
            "Heat a pan, add a little butter, and toast the buns in the pan.",
            "Place the toasted buns on an assembly board.",
            "Spread mayonnaise on the inner side of both bun halves.",
            "Place a crisp lettuce leaf on the bottom bun.",
            "Add the fried Aloo Tikki on top of the lettuce.",
            "Place onion rings on top of the tikki.",
            "Add lots of grated or sliced cheese on top.",
            "Cover the assembly with the top half of the bun.",
            "Your homemade Cheesy Aloo Tikki Burger is ready to serve. Enjoy it at any time of the day!"
        ]
    }
]