[
    {
        "name": "Chole Kebab",
        "ingredients": [
            "White Chole (Chickpeas), soaked overnight",
            "Water",
            "Baking Soda (optional)",
            "Oil",
            "Asafoetida",
            "Carom Seeds",
            "Finely chopped Garlic",
            "Finely chopped Ginger",
            "Green Chilli, finely chopped",
            "Finely chopped Onion",
            "Boiled and peeled Potato",
            "Chole Masala",
            "Amchoor (Dry Mango Powder)",
            "Salt (as per taste)",
            "Black Salt",
            "Freshly chopped Coriander"
        ],
        "instructions": [
            "Take the white Chole (Chickpeas) that have been soaked overnight to ensure they cook quickly.",
            "Add the soaked Chole to a pressure cooker along with water. Optionally, add a little baking soda to help them cook faster.",
            "Cook the Chole in the pressure cooker for 2-3 whistles until they are soft and cooked.",
            "Strain the water from the cooked Chole and let them cool. Check their doneness by mashing them – they should mash easily.",
            "Heat oil in a pan. Add Asafoetida and Carom Seeds, which are a good combination with Chole.",
            "Add finely chopped Garlic, Ginger, Green Chilli, and Onion to the pan. Cook the Onion until it starts turning light brown but not fully browned.",
            "Add Chole Masala and a little Amchoor to the pan. Stir quickly to release aroma.",
            "Add the boiled Chole to the pan and mix well.",
            "Mash a boiled and peeled Potato and add it to the pan for binding.",
            "Season with Salt as per taste and a little Black Salt. Stir well to ensure the mixture is evenly mixed.",
            "Cook the mixture for about 3-4 minutes to dry out any extra water. This ensures no additional binding agents (Corn Starch, Gram Flour, All-Purpose Flour, or Bread Crumbs) are needed.",
            "Remove the mixture from the pan and mash it while it is still hot. Mashing is easier while the mixture is hot.",
            "Add freshly chopped Coriander to the mashed mixture and mix well. Let the mixture cool completely.",
            "Shape the mixture into round balls, then flatten them to form Tikki (patty) shapes.",
            "If desired, taste the mixture to ensure seasoning is correct. Add Salt, Chilli, or Chaat Masala if needed.",
            "Heat a pan and cook the Tikki in Ghee or Oil. Make sure the pan is hot before placing the Tikki.",
            "Gently press the Tikki to shape it evenly and ensure it has clean edges. This will enhance its appearance.",
            "Cook the Tikki on the pan. Note: Since no binding agents were added, the Tikki cannot be deep-fried. You can air-fry them as an alternative.",
            "Allow the Tikki to develop a golden brown color on one side before flipping it carefully.",
            "Cook the other side until it is also golden brown. The Tikki will hold its shape once it is cooked."
        ]
    },
    {
        "name": "Curd Chutney with Roasted Sesame Seeds",
        "ingredients": [
            "Sesame Seeds",
            "Thick Curd",
            "Salt (as per taste)",
            "Black Pepper",
            "Grated Garlic",
            "Freshly chopped Coriander Leaves",
            "Lemon (optional)"
        ],
        "instructions": [
            "Heat a pan on low flame and add Sesame Seeds.",
            "Roast the Sesame Seeds on low flame until they turn light golden brown and start crackling. This develops a nutty flavor.",
            "Grind the roasted Sesame Seeds into a coarse powder using a mortar and pestle or grinder.",
            "Transfer the coarse Sesame Seed powder to a bowl.",
            "Add thick Curd to the bowl. Ensure the Curd is not too watery; it should be thicker than Raita consistency.",
            "Season with Salt as per taste, a little Black Pepper, and a small amount of grated Garlic.",
            "Add freshly chopped Coriander Leaves to the mixture.",
            "If the Curd is not very sour, add a squeeze of Lemon juice for an additional tangy flavor.",
            "Mix all the ingredients together until well combined to form a flavorful Curd Chutney."
        ]
    }
]