[
    {
        "name": "Mixed Pulses Cutlet",
        "ingredients": [
            "Pulses of your choice (e.g., Moong, Matki, Channa, White Peas)",
            "Boiled and peeled potatoes (or sweet potatoes, yam, purple yam, tubers of choice)",
            "Roughly chopped red onions",
            "Lots of coriander leaves",
            "Rice flour",
            "Red chilli powder",
            "Chaat masala",
            "Garam masala (home ground)",
            "Finely chopped garlic",
            "Salt (use cautiously if already added to pulses or potatoes)",
            "Oil (olive oil or any seed oil of choice)"
        ],
        "instructions": [
            "Take pulses of your choice, wash them once or twice over, and soak them overnight.",
            "Cook the soaked pulses until ready. This process makes them more digestible, increases nutrient value, and improves gut health.",
            "Take boiled and peeled potatoes in a large bowl and mash them with the help of a fork. You may substitute classic potatoes with sweet potatoes, yam, purple yam, or any tubers of your choice.",
            "Add the steamed pulses to the mashed potatoes. Use a combination of Moong, Matki, Channa, and White Peas.",
            "Add roughly chopped red onions, lots of coriander leaves, rice flour (to help crispen the cutlets), red chilli powder (adjust for heat preference), chaat masala, a touch of home-ground garam masala, finely chopped garlic, and salt. Use salt cautiously if it was already added to the pulses or potatoes during cooking.",
            "Mix all the ingredients thoroughly to bring the cutlet mixture together.",
            "Keep a bowl of water handy to wet your fingers, making it easier to shape the cutlets.",
            "Shape the mixture into cutlets or tikkis. Note that ‘tikki’ is a North Indian term, while ‘cutlet’ can be used in Gujarati, Bengali, Maharashtrian, or South Indian contexts.",
            "Apply a little oil on the cutlet. Transfer it onto a hot griddle, oil side facing down.",
            "Apply some more oil on the top surface of the cutlet and allow it to fry until golden brown on both sides. Flip it once or twice during the process.",
            "Once the mixed pulses cutlets turn golden brown, remove them from the griddle.",
            "Serve the cutlets with a healthy dip or ketchup as per preference."
        ]
    }
]