[
    {
        "name": "Dahi Ke Sholay",
        "ingredients": [
            "Hung Curd",
            "Yellow Bell Peppers",
            "Red Bell Peppers",
            "Salt (as required)",
            "Freshly cracked Black Pepper",
            "Bread slices",
            "Water",
            "Oil (for deep frying)"
        ],
        "instructions": [
            "Chop the Yellow and Red Bell Peppers as finely as possible. Start by cutting them into thin juliennes, then turn them over and chop them into fine pieces.",
            "Prepare the stuffing or filling by adding the finely chopped Yellow and Red Bell Peppers to the Hung Curd.",
            "Add Salt as required and Freshly cracked Black Pepper to the mixture. Mix everything together until it comes together. The Dahi Ke Sholay mixture is now ready.",
            "Cut a bread slice and keep it ready. Dip the bread slice in water, pull it out, and remove all the excess water. This will make the bread like a thin sheet which will be used as a casing for the recipe.",
            "Take a spoonful of the filling and place it in the center of the bread sheet. Pull one side of the bread towards you to encase the filling. Press and encase the sides as well, ensuring the shape resembles two cones connected with each other.",
            "Press the prepared shape to remove all the excess water, keeping in mind that the bread casing will be deep-fried later. Repeat the process to make more shapes.",
            "Once shaped, you can either fry them immediately or freeze them for later use. If freezing, fry them when your guests arrive.",
            "Heat oil for deep frying. Ensure the oil is hot enough before frying to avoid burning your fingers.",
            "When frying bread-based casings, allow them to stay in the oil for at least 30-40 seconds before stirring. This helps create a golden-brown crust and prevents the casing from sticking to the slotted spoon.",
            "Once fried, transfer the Dahi Ke Sholay to an absorbent tissue paper to remove excess oil.",
            "Cut one of the fried Dahi Ke Sholay to check the filling inside. Serve hot.",
            "Dahi Ke Sholay is ready to be served as a starter for any season or occasion. Enjoy with your family or friends."
        ]
    }
]