[
    {
        "name": "Chatpata Nutrella Soya Mini Chunks Chaat",
        "ingredients": [
            "Nutrella Soya Mini Chunks",
            "Nutrella Refined Sunflower Oil",
            "Sweet potato (diced and steamed)",
            "Few curry leaves",
            "Half a teaspoon of Hing",
            "One teaspoon of Kashmiri Red Chilli Powder",
            "Half a teaspoon of Black Salt",
            "Half a teaspoon of Chaat Masala",
            "Two tablespoons of Date and Tamarind Chutney",
            "Half a lemon",
            "Coriander leaves (finely chopped)",
            "Curd",
            "Green chutney",
            "Tomatoes (finely chopped)",
            "Onions (finely chopped)",
            "Pooris (crushed)",
            "Fried chana dal",
            "Fine sev",
            "Pomegranate seeds",
            "Roasted jeera powder",
            "Red chilli powder"
        ],
        "instructions": [
            "Cook Nutrella Soya Mini Chunks for 10 minutes. Strain, give it a good rinse, squeeze out all the excess water, and it's ready to use.",
            "Heat one and a half tablespoons of Nutrella Refined Sunflower Oil in two separate pans simultaneously.",
            "In one pan, add a few curry leaves and half a teaspoon of Hing. Add the cooked Soya Chunks and toss them for a minute.",
            "In the other pan, add the diced and steamed sweet potato to the heated oil. Cook separately as the cooking time for the ingredients is different.",
            "Mix the roasted Soya Chunks and sweet potato together once both are cooked. Turn off the flame.",
            "Enhance the flavor by adding one teaspoon of Kashmiri Red Chilli Powder, half a teaspoon of Black Salt, half a teaspoon of Chaat Masala, and two tablespoons of Date and Tamarind Chutney.",
            "Squeeze half a lemon over the mixture and give it a good mix. Add finely chopped coriander leaves and give it a final stir.",
            "In a serving bowl, spread some curd and drizzle some green chutney.",
            "Place the roasted soya chunks and sweet potato mixture in the center of the bowl.",
            "Top with finely chopped tomatoes, finely chopped onions, crushed pooris for an extra crunch, fried chana dal, fine sev, pomegranate seeds, roasted jeera powder, red chilli powder, and more finely chopped coriander leaves.",
            "Serve and enjoy the Chatpata Nutrella Soya Mini Chunks Chaat."
        ]
    }
]