[
    {
        "name": "Soya Litti Chokha with a Twist",
        "ingredients": {
            "Chokha": [
                "1 Brinjal",
                "Few Garlic Cloves",
                "2 Tomatoes",
                "1 boiled and mashed Potato",
                "1 Onion, finely chopped",
                "5 Green Chillies, finely chopped",
                "A handful of Coriander Leaves",
                "1 tsp of Cumin Seed Powder",
                "1 tsp of Garam Masala Powder",
                "1 tsp of Black Salt",
                "Juice of half a Lemon",
                "1.5 tbsp of Mustard Oil"
            ],
            "Soya Filling": [
                "1 cup of Nutrella Soya Granules",
                "1 tsp of Coriander Seeds",
                "1 tsp of Garam Masala Powder",
                "1 tsp of Red Chilli Powder",
                "1 tsp of Cumin Seeds Powder",
                "1 tsp of Raw Mango Powder",
                "1 tsp of Turmeric Powder",
                "1 Onion, finely chopped",
                "1 tsp of Ginger-Garlic Paste",
                "2 Green Chillies, finely chopped",
                "Coriander Leaves",
                "Salt to taste",
                "1 tbsp of Spicy Mango Pickle",
                "2 tbsp of Nutrella Mustard Oil"
            ],
            "Dough for Litti": [
                "1.5 cups of Wheat Flour",
                "1 tsp of Ajwain (Carom Seeds)",
                "1 tbsp of Mustard Oil",
                "2 tbsp of Ghee",
                "Salt to taste",
                "A pinch of Soda",
                "Water (to knead the dough)"
            ]
        },
        "instructions": [
            "Take the Brinjal and score it. Stuff some Garlic Cloves into the scored areas.",
            "Place the Brinjal and 2 Tomatoes on the griller. Turn on the flame and let them grill on medium heat, turning them around occasionally until charred.",
            "In boiling hot water, add in 1 cup of Nutrella Soya Granules. Stir and boil for 10 minutes. Once done, strain the granules, rinse them well, and squeeze out all excess water.",
            "Once the Brinjal and Tomatoes are beautifully charred, remove them from the flame and place them in a bowl. Cover the bowl with cling film to soften the skin.",
            "To prepare the filling for the Litti, take the cooked Nutrella Soya Granules and add the following spices: 1 tsp of Coriander Seeds, 1 tsp of Garam Masala Powder, 1 tsp of Red Chilli Powder, 1 tsp of Cumin Seeds Powder, 1 tsp of Raw Mango Powder, and 1 tsp of Turmeric Powder.",
            "Add fresh ingredients to the mixture: 1 finely chopped Onion, 1 tsp of Ginger-Garlic Paste, 2 finely chopped Green Chillies, Coriander Leaves, Salt to taste, 1 tbsp of Spicy Mango Pickle, and 2 tbsp of Nutrella Mustard Oil. Mix everything well. The stuffing is now ready.",
            "Prepare the dough for the Litti by combining 1.5 cups of Wheat Flour, 1 tsp of Ajwain (Carom Seeds), 1 tbsp of Mustard Oil, 2 tbsp of Ghee, Salt to taste, and a pinch of Soda. Add water gradually to make a normal Roti dough.",
            "Take a small portion of the dough and roll it into a ball. Flatten it slightly to make a depression in the center. Add the Soya mixture as stuffing in the depression, bring all the edges together, and seal them to form a round ball. Repeat this process for all Littis.",
            "Grease a baking tray and place the shaped Littis on it. Grease the Littis with Oil as well.",
            "Bake the Littis in a preheated oven at 180 degrees Celsius for around 30 minutes. Alternatively, you can cook them in a pressure cooker without the vent valve for 25-30 minutes, tossing them occasionally.",
            "While the Littis are baking, prepare the Chokha. Remove the cling wrap from the grilled Brinjal and Tomatoes. Peel off their skin and chop the Tomatoes roughly. Mash the Brinjal and Tomatoes finely.",
            "Add one boiled and mashed Potato to the mash, followed by 1 finely chopped Onion, 5 finely chopped Green Chillies, a handful of Coriander Leaves, 1 tsp of Cumin Seed Powder, 1 tsp of Garam Masala Powder, 1 tsp of Black Salt, Juice of half a Lemon, and 1.5 tbsp of Mustard Oil. Mix everything together. The Chokha is now ready.",
            "Once the Littis are baked, cool them down for 5 minutes. Then grill them on an open flame to achieve a charred exterior, flipping them occasionally.",
            "The Soya Stuffed Littis with the Chatpata Chokha are now ready to serve. This nutritious and delicious dish is perfect for kids and a great way to combine health with tradition."
        ]
    }
]