[
    {
        "name": "Bhuna Paneer Roll",
        "ingredients": [
            "Oil",
            "Cumin Seeds",
            "2 chopped Onions",
            "Ginger-Garlic Paste",
            "Turmeric Powder",
            "Red Chilli Powder",
            "Ajwain (Carom Seeds)",
            "Crushed Coriander Seeds",
            "Black Pepper Powder",
            "Salt",
            "Tomato Puree",
            "Onions (sliced)",
            "Capsicum (sliced)",
            "Malai Paneer (cut into pieces)",
            "Chilli Powder",
            "Chaat Masala",
            "Ready-made Malabari Parathas",
            "Mayonnaise",
            "Raw Onions (sliced)",
            "Lemon Juice",
            "Butter Sheet"
        ],
        "instructions": [
            "Begin with Bhuna Paneer. Add Oil in a pan and heat it.",
            "Add Cumin Seeds and let them splutter.",
            "Add 2 chopped Onions and sauté them till they roughly become golden brown in colour.",
            "Add Ginger-Garlic Paste and sauté till the raw flavour of the Ginger and Garlic goes away.",
            "Add dry spices: Turmeric Powder, Red Chilli Powder (for colour and heat), Ajwain (Carom Seeds), Crushed Coriander Seeds, Black Pepper Powder, and Salt.",
            "Pan fry the Masala or 'Bhuno' the Masala on medium-low flame. This is a technique of slow cooking where the Masala turns several shades of brown, becoming caramelised and richer.",
            "Add Tomato Puree to the Masala and continue slow cooking (Bhuno-ing) the mixture.",
            "Move the Masala to one side of the pan. On the empty side, add a touch of Oil.",
            "Add sliced Onions, Capsicum, and Paneer pieces (use Malai Paneer for softness).",
            "Top this mixture with a touch of Salt, Chilli Powder, and Chaat Masala.",
            "Mix the Onions, Capsicum, Paneer, and spices well. Ensure that the Capsicum and Onions cook but retain a bite for texture.",
            "Once the Paneer, Capsicum, and Onion mix is done, set it aside. The Bhuna Masala is also ready.",
            "Take ready-made Malabari Parathas (frozen ones can be defrosted and pan-fried slightly). Lay them on the worktop.",
            "Smear a little Mayonnaise onto the Paratha to ensure the roll becomes moist.",
            "Add the Bhuna Masala as the base layer.",
            "Top this with the Onion, Capsicum, and Paneer mix.",
            "Add some raw sliced Onions on top.",
            "Sprinkle Chaat Masala and drizzle Lemon Juice.",
            "Roll the Paratha tightly, ensuring all the filling stays inside.",
            "Wrap the roll in a Butter Sheet and secure it by pushing all of it together compactly.",
            "Your Bhuna Paneer Roll is done and ready. Repeat the process for additional rolls.",
            "This is a perfect recipe to enjoy with friends or family!"
        ]
    }
]