[
    {
        "name": "Green Moong Dal Paratha with Tadka Raita",
        "ingredients": [
            "Green Moong Dal (with skin, soaked overnight or for at least 2 hours)",
            "Wheat Flour",
            "Cumin Seeds",
            "Kasuri Methi (or fresh Fenugreek Leaves/Radish Leaves if available)",
            "Salt (as per taste)",
            "Turmeric",
            "Chilli Powder",
            "Asafoetida (optional)",
            "Finely chopped Ginger",
            "Green Chilli",
            "Finely chopped Onion (optional)",
            "Mango Pickle Masala",
            "Oil from Mango Pickle",
            "Freshly Chopped Coriander",
            "Water (for kneading)",
            "Oil or Ghee (for cooking)"
        ],
        "instructions": [
            "Soak the Green Moong Dal overnight or for at least 2 hours. Drain the water and grind the Dal coarsely in small intervals, making sure it does not turn into a fine paste.",
            "If you have a sieve and the patience, you can rub the Dal through the sieve for a finer texture.",
            "To the coarsely ground Dal, add Wheat Flour, a little Cumin Seeds, Kasuri Methi (or fresh Fenugreek Leaves/Radish Leaves finely chopped if available), Salt, Turmeric, Chilli Powder, Asafoetida (optional), finely chopped Ginger, Green Chilli, and finely chopped Onion (if you consume Onion).",
            "Add Mango Pickle Masala and the oil from the Mango Pickle for a tangy flavor. Mix in a good quantity of freshly chopped Coriander.",
            "Gradually add water and knead the mixture into a tight dough. Ensure it is kneaded well.",
            "Cover the dough and let it rest for at least 15 minutes.",
            "While the dough is resting, prepare the Tadka Raita. Beat Curd and add Salt, a little Red Chilli Powder, finely chopped Onion, Tomato, and Freshly Chopped Coriander.",
            "For the tempering of the Raita, heat Oil in a pan (you can use Mustard Oil for added flavor). Add Asafoetida, Dry Red Chilli Powder, and a pinch of Cumin Seeds. Turn off the gas once the Cumin Seeds splutter and pour the tempering into the Raita. Beat well. The Raita is ready.",
            "After the dough has rested, cut it into portions (Pedas) based on the size of Parathas you want to make. Shape the portions roughly.",
            "Roll out each Peda slightly and add a little Oil or Ghee in the center. Cut a slit in the middle, roll it into a cone shape, and press it gently.",
            "Let the shaped Pedas rest for at least 5 minutes to make them easier to roll.",
            "Roll each Peda into a Paratha shape. It can be round, square, triangular, or even amoeba-shaped. The taste will remain delicious regardless of the shape.",
            "Heat a pan and sprinkle a little dry flour on the rolled-out Paratha to prevent sticking. Cook the Paratha on one side.",
            "Flip it over and add a little Oil or Ghee to the cooked side. Flip it again and repeat for the second side.",
            "Cook the Paratha until it gets a beautiful color and is cooked well from both sides. The aroma of Fenugreek and the spices will be delightful.",
            "Serve the hot Paratha with the prepared Tadka Raita."
        ]
    }
]