[
    {
        "name": "Veg Oats Uttapam",
        "ingredients": [
            "1 cup Rolled Oats",
            "1 cup Rava or Sooji",
            "1 cup Buttermilk",
            "1 tsp Baking Soda",
            "1 tsp Salt",
            "½ cup Water (added in batches)",
            "1 tsp Grated Ginger",
            "1 Green Chilli (chopped)",
            "1 tsp Cumin Seeds",
            "Grated Carrot",
            "Chopped Onions",
            "Chopped Tomatoes",
            "Chopped Capsicum",
            "Chopped Coriander Leaves",
            "Oil (for cooking)"
        ],
        "instructions": [
            "Firstly, transfer 1 cup of rolled oats to a grinder.",
            "Add 1 cup of Rava or Sooji.",
            "Grind the oats and Rava into a fine powder. This mixture will be the base for the Uttapam.",
            "Add 1 cup of Buttermilk to the mixture.",
            "Add 1 tsp of Baking Soda and 1 tsp of Salt.",
            "Mix well and add ½ a cup of water in batches to bring it to the consistency of a batter.",
            "Keep the batter aside and let it rest for 15 minutes.",
            "Prepare the flavouring for the batter: Add 1 tsp of Grated Ginger, 1 Green Chilli (chopped), and 1 tsp of Cumin Seeds to the rested batter. Mix well.",
            "In a non-stick pan, spread a little Oil.",
            "Pour a ladle full of batter into the pan and spread it evenly. Keep it thick to make it easier to flip.",
            "Sprinkle Grated Carrot, Chopped Onions, Chopped Tomatoes, Chopped Capsicum, and Chopped Coriander Leaves on top.",
            "Cover the pan with a lid and let the Uttapam cook for 2 minutes.",
            "Once the base is firm and cooked, flip the Uttapam and let it cook from the other side for a minute.",
            "The Veg Oats Uttapam is now ready. Serve it with Spicy Tomato Chutney and enjoy a perfect combination of nutrition and taste.",
            "Until we meet again, eat well, live well and stay blessed."
        ]
    }
]