[
    {
        "name": "Soya Green Peas Toast",
        "ingredients": [
            "3/4 cup Soya Granules",
            "3/4 cup Green Peas (boiled)",
            "1.5 tbsp Nutella Sunflower Oil",
            "1 tsp Cumin Seeds",
            "1 Onion (finely chopped)",
            "1 tbsp Ginger and Garlic Paste",
            "1 Tomato (finely chopped)",
            "1 tsp Turmeric Powder",
            "1 tsp Red Chilli Powder",
            "1 tsp Garam Masala Powder",
            "1 tsp Coriander Cumin Seed Powder",
            "Salt (to taste)",
            "Lemon Juice",
            "Coriander Leaves",
            "Cheese",
            "Butter",
            "Bread slices",
            "Green Chutney",
            "Cherry Tomatoes (wedges)",
            "Less spicy Green Chillies",
            "Ketchup"
        ],
        "instructions": [
            "Boil 3/4 cup of Soya Granules in boiling water for around 10 minutes. Drain out the water, give it a rinse, and squeeze out all the excess water.",
            "Grind 3/4 cup of boiled Green Peas into a coarse mixture.",
            "Heat 1.5 tbsp of Nutella Sunflower Oil in a pan. Turn on the flame.",
            "Add 1 tsp of Cumin Seeds to the heated oil.",
            "Add 1 finely chopped Onion and sauté till it becomes soft.",
            "Add 1 tbsp of Ginger and Garlic Paste and sauté for a few seconds.",
            "Add 1 finely chopped Tomato and cook till it becomes soft.",
            "Add the coarsely ground Green Peas and cook for 3-4 minutes until the mixture dries out slightly.",
            "Add the Nutella Soya Granules and mix well.",
            "Add the seasoning ingredients: 1 tsp Turmeric Powder, 1 tsp Red Chilli Powder, 1 tsp Garam Masala Powder, 1 tsp Coriander Cumin Seed Powder, and Salt to taste. Mix well.",
            "Squeeze some Lemon Juice and mix again.",
            "Turn off the flame and add some Coriander Leaves.",
            "Add Cheese to the mixture after you've turned off the flame. Mix well.",
            "Heat a little Butter in a pan. Once it starts to melt, place the bread slices and toast them on low heat until crisp.",
            "Apply a little bit of Green Chutney over the toasted bread. Be careful not to add too much to avoid sogginess.",
            "Place the prepared mixture over the bread.",
            "Add some more Cheese on top of the mixture.",
            "Place a few Cherry Tomato wedges and garnish with less spicy Green Chillies.",
            "Cover the pan and let the toast cook until the Cheese melts.",
            "Remove the toasts from the pan and drizzle some Ketchup over them.",
            "Serve the Soya Green Peas Toast. Enjoy!"
        ]
    }
]