[
    {
        "name": "Soya Keema Paratha",
        "ingredients": [
            "Water",
            "Salt",
            "Turmeric Powder",
            "Ginger",
            "Green Chilli",
            "Soya Chunks",
            "Ghee",
            "Cumin Seeds",
            "Asafoetida",
            "Onion (optional)",
            "Chilli Powder",
            "Coriander Powder",
            "Chaat Masala",
            "Pav Bhaji Masala",
            "Dry Fenugreek Leaves",
            "Freshly Chopped Coriander",
            "Oil",
            "Dry Flour"
        ],
        "instructions": [
            "Keep water to boil to cook the Soya Chunks.",
            "Add a little Salt, Turmeric, Ginger, and a Green Chilli to the boiling water.",
            "Give it a quick boil.",
            "Strain the Soya Chunks and spread them on a plate to cool down.",
            "Grind the cooled Soya Chunks in a mixer grinder to prepare the Keema.",
            "While the Soya Chunks are cooling, knead the dough.",
            "Make the dough a little tight by adding a little Ghee and Salt.",
            "Rub the Ghee and Salt into the dough lightly with your hands.",
            "Add water and knead it just like regular dough.",
            "Let the dough rest for 15 minutes.",
            "To cook the Keema, heat a pan with a little Oil.",
            "Add a little Asafoetida and Cumin Seeds to the hot Oil and let them crackle.",
            "Add finely chopped Ginger and give it a quick stir.",
            "Add Onion (optional) and stir-fry on high heat without browning it.",
            "Add Turmeric Powder, Chilli Powder, Coriander Powder, Chaat Masala, and Pav Bhaji Masala to the pan.",
            "Mix the spices well.",
            "Add the ground Soya Keema to the pan.",
            "Season with Salt as per taste.",
            "Add Dry Fenugreek Leaves and Freshly Chopped Coriander.",
            "Mix everything and roast the Keema without adding water.",
            "Spread the roasted Keema on a plate and let it cool completely before stuffing it into the dough.",
            "Take the rested dough and stuff it with the cooled Keema mixture.",
            "Shape the dough into a clean Peda.",
            "Spread the dough lightly like a bowl, ensuring the sides are thin.",
            "Add the Keema mixture into the center and close the dough carefully.",
            "Roll the stuffed Peda lightly with your hands.",
            "Dust the rolled Peda with a little Dry Flour.",
            "Press the Peda lightly and spread it with a rolling pin.",
            "If the mixture is very wet, add a spoon of Dry Flour to it before stuffing to prevent the Paratha from bursting.",
            "Roast the Paratha on a hot griddle.",
            "Flip it once, then again.",
            "Spread a little Oil evenly on one side and flip it again.",
            "Spread a little Oil on the other side as well.",
            "Gently press the sides to ensure they cook evenly without remaining raw.",
            "Cook until the Paratha has a nice, crispy texture and golden color.",
            "Cut the Paratha to check if the Soya Keema is evenly spread.",
            "Repeat the process for the remaining Parathas.",
            "Enjoy your Soya Keema Paratha!"
        ]
    }
]