[
    {
        "name": "Black Chickpea Chaat",
        "ingredients": [
            "Black chickpeas (soaked overnight)",
            "Water",
            "Salt (to taste)",
            "Oil",
            "Bay leaves",
            "Asafoetida",
            "Black cardamom",
            "Cloves",
            "Black pepper",
            "Ginger",
            "Green chillies",
            "Kashmiri red chilli powder",
            "Turmeric powder",
            "Coriander powder",
            "Kasuri methi powder",
            "Boiled potatoes (finely chopped)",
            "Onions (finely chopped)",
            "Green onions (optional)",
            "Cucumber",
            "Tomato",
            "Black salt",
            "Roasted and crushed cumin seeds",
            "Chaat masala",
            "Dry mango powder",
            "Red chilli powder",
            "Lemon juice",
            "Chopped coriander",
            "Pomegranate"
        ],
        "instructions": [
            "Soak the black chickpeas overnight.",
            "Add the soaked black chickpeas to a pressure cooker with water and salt to taste.",
            "Cook for 4-5 whistles or until the chickpeas are tender. If not fully cooked, cook for a little longer.",
            "Once done, let the chickpeas cool slightly.",
            "Heat a kadhai and add a little oil. Heat the oil well.",
            "Add bay leaves, asafoetida, black cardamom, cloves, and black pepper. Stir well.",
            "Add ginger and green chillies to the tempering. Stir.",
            "Add powdered spices: Kashmiri red chilli powder, turmeric powder, and coriander powder. Stir on low flame.",
            "Add the boiled black chickpeas to the tempering. Increase the flame and cook.",
            "Add the water from the chickpeas to the kadhai and let it reduce while stirring occasionally. Let the water dry partially, leaving a little moisture.",
            "Add salt to taste and a little kasuri methi powder. Mix well and cook for 5-10 minutes.",
            "Turn off the flame and remove bay leaves and black cardamom from the mixture.",
            "To make the chaat, transfer the cooked black chickpeas to a mixing bowl.",
            "Add boiled potatoes (finely chopped), onions, cucumber, tomatoes, and green onions (optional).",
            "Season with black salt, roasted and crushed cumin seeds, chaat masala, dry mango powder, and red chilli powder.",
            "For extra spiciness, add chopped green chillies.",
            "Squeeze lots of lemon juice over the mixture.",
            "Add a generous amount of chopped coriander and pomegranate for a fruity flavor.",
            "Mix all the ingredients well to combine the flavors.",
            "Serve the chaat hot or let it cool and serve later, as per your preference."
        ]
    }
]