[
    {
        "name": "Dal-Motki Chaat",
        "ingredients": [
            "Motki Dal (Matki Dal)",
            "Water (for soaking and boiling)",
            "Salt",
            "Turmeric",
            "Dry Mango Powder (Amchur)",
            "Black Salt",
            "Sugar",
            "Chili Powder",
            "Roasted Cumin Seeds (crushed)",
            "Boiled and Peeled Potato",
            "Cucumber",
            "Chopped Tomatoes",
            "Green Chili",
            "Chopped Coriander",
            "Pomegranate Seeds",
            "Chopped Onion",
            "Chaat Masala",
            "Lemon"
        ],
        "instructions": [
            "Wash the Motki Dal well in water and soak it for at least 3-4 hours.",
            "After soaking, take it out of the water and tie it in a cloth to allow it to sprout. Wet the cloth and tie it securely.",
            "Hang the cloth near a water source (e.g., tap) and keep it wet continuously for at least 2 nights. This will help the seeds sprout.",
            "Once the Dal has sprouted, put it in a pan. Add water, a little salt, and a little turmeric. Boil it until it remains crunchy but is slightly cooked.",
            "While the Dal is boiling, prepare the chutney. In a bowl, mix dry mango powder, black salt, sugar, a little salt, chili powder, and roasted cumin seeds. Add water and mix to avoid lumps.",
            "Once the Dal has come to a boil and has a nice color, turn off the gas and strain the Dal. Set it aside to cool.",
            "In a fresh pan, add the dry mango powder mixture and cook it. The dry mango powder will thicken the chutney as it boils. Add enough water to achieve a flowy consistency.",
            "Cook the chutney for 3-4 minutes until it is thin and runny. Turn off the gas and let it cool. As it cools, it will thicken further.",
            "Pour the cooled chutney into a separate container. Save as much chutney as possible, even if it spills slightly during pouring.",
            "For assembling the chaat, take the Dal Mod and put it in a big bowl or platter.",
            "Add boiled and peeled potato (chopped), cucumber (chopped), chopped tomatoes, green chili, chopped coriander, pomegranate seeds, chopped onion, a little salt, black salt, generous amounts of chaat masala, and the Amchur chutney. Squeeze a little lemon on top.",
            "Mix everything thoroughly until the chaat is well combined and aromatic.",
            "For an alternative plating, take a cucumber and make a 'cucumber boat.' Cut the cucumber in half lengthwise. Use a spoon to scrape out the seeds and hollow out a space in the middle.",
            "Fill the cucumber boat with the prepared Dal Mod Chaat and serve. Enjoy!"
        ]
    }
]