[
    {
        "name": "Kala Chana Kebab",
        "ingredients": [
            "Black Chickpeas (soaked overnight or for at least 4 hours, strained)",
            "Asafoetida",
            "Cumin Seeds",
            "Garlic",
            "Ginger",
            "Onion (roughly chopped)",
            "Green Chilli",
            "Curry Leaves (optional)",
            "Salt (as per taste)",
            "Red Chilli Powder",
            "Coriander Powder",
            "Dry Fenugreek Leaves",
            "Finely Chopped Coriander Leaves",
            "Grated Carrots",
            "Finely Chopped Beans",
            "Water (for binding if needed)",
            "Oil (for roasting)"
        ],
        "instructions": [
            "Soak the black chickpeas in water overnight or for at least 4 hours. Strain them to remove excess water.",
            "Put the soaked chickpeas in a mixer grinder.",
            "Add asafoetida, cumin seeds, garlic, ginger, roughly chopped onion, green chilli, curry leaves (optional), salt, red chilli powder, coriander powder, and dry fenugreek leaves into the grinder.",
            "Grind the mixture coarsely. Make sure it is not a paste but coarsely ground.",
            "Check the texture of the mixture. If it is too thick, grind it a bit more until it is coarsely ground but not completely smooth.",
            "Transfer the ground mixture into a bowl and add finely chopped coriander leaves, grated carrots, and finely chopped beans.",
            "Mix everything well and taste the mixture. Adjust salt or chilli powder as per your preference.",
            "Test the binding by pressing the mixture in your hand. If it doesn't bind, add a small amount of water. Do not use potatoes, cornstarch, maida, or slurry for binding. The mixture will bind naturally when cooked.",
            "Shape the mixture into rough Tikki shapes by pressing it in your palm. If the mixture feels tricky to handle, wet your hands slightly for easier shaping.",
            "Heat medium-hot oil in a pan. Gently press the kebabs a little before placing them into the oil.",
            "Roast the kebabs in medium-hot oil. Add a little oil on top of the kebabs and flip them carefully when the bottom layer is cooked.",
            "Cook the kebabs on low to medium heat until they are cooked through. Ensure the black chickpeas are soft and cooked as they were soaked and finely ground beforehand.",
            "Remove the kebabs from the pan and serve them hot."
        ]
    },
    {
        "name": "Spicy Yogurt Dip",
        "ingredients": [
            "Dry Red Chillies (soaked in water overnight)",
            "Fresh Water",
            "Onion (roughly chopped)",
            "Garlic",
            "Cumin Seeds",
            "Whole Coriander",
            "Fennel Seeds",
            "Salt",
            "Curd (Yogurt)",
            "Lemon",
            "Chaat Masala"
        ],
        "instructions": [
            "Take the dry red chillies soaked in water overnight and transfer them to a pan.",
            "Add fresh water to the pan. Avoid using the chilli-soaked water as it will make the dip excessively spicy.",
            "Add roughly chopped onion, garlic, cumin seeds, whole coriander, fennel seeds, and salt to the pan.",
            "Cook the mixture until the water dries up and the onion, garlic, and spices become soft.",
            "Transfer the cooked mixture to a plate and let it cool down. Be cautious as cooking chillies can release fumes that may cause sneezing. Turn on the exhaust fan and stay at a distance while handling the steam.",
            "Once the mixture cools down, transfer it to a mixer grinder.",
            "Add a little curd (yogurt) to help the grinder work smoothly.",
            "Squeeze in a little lemon juice to balance the chilli's spiciness and enhance the flavor.",
            "Grind the mixture until smooth. The spices may remain slightly coarse, which is fine.",
            "Add a little chaat masala to the ground mixture to make the dip spicier and flavorful.",
            "Mix well and taste the dip. Adjust the seasoning if needed.",
            "Serve the spicy yogurt dip alongside the Kala Chana Kebabs."
        ]
    }
]