[
    {
        "name": "Moonglet",
        "ingredients": [
            "Moong Dal (washed and soaked for 2 hours)",
            "Ginger",
            "Turmeric",
            "Water",
            "Finely chopped onions (optional)",
            "Finely chopped green chillies",
            "Cumin seeds",
            "Finely chopped carrots or grated carrots",
            "Finely chopped tomatoes",
            "Coriander leaves",
            "Finely chopped capsicum",
            "Salt (as per taste)",
            "Curry leaves (optional, whole or chopped)",
            "Eno (1 tsp) or Baking powder (1 tsp) or Baking soda (1 tsp with 2 tbsp curd)",
            "Oil (for cooking)"
        ],
        "instructions": [
            "Take Moong Dal, wash it, and soak it for at least 2 hours.",
            "Once soaked, strain the Moong Dal.",
            "Grind the lentils along with a little ginger, a little turmeric, and a little water. Start with less water to avoid thinning the batter. Gradually add water and lentils to achieve a nice, thick, smooth batter.",
            "Transfer the batter to a bowl.",
            "Add finely chopped onions (optional), finely chopped green chillies, cumin seeds, finely chopped or grated carrots, chopped tomatoes, coriander leaves, capsicum, and salt as per taste.",
            "Optionally, add curry leaves (whole or chopped) for added flavor.",
            "Mix all the ingredients well to prepare the Moonglet batter.",
            "To make the batter light, add 1 tsp of Eno. Alternatively, you can use 1 tsp baking powder, or 1 tsp baking soda with 2 tbsp curd. Mix gently to aerate the batter and make it light and fluffy.",
            "Take a non-stick pan and add oil to it. Let the oil heat up nicely.",
            "Pour the batter into the pan, spreading it evenly to form the base of the pan.",
            "Turn the gas to low and cover the pan to allow steam to form. This will keep the Moonglet moist and fluffy.",
            "Once the Moonglet is cooked on one side, drizzle a little more oil on top and flip it. Cook until it becomes crispy on the outside and soft on the inside.",
            "Puncture the Moonglet slightly with a knife to check if there is any raw batter inside. Cover and let it cook further if needed.",
            "Once fully cooked, plate the Moonglet. Repeat the process to prepare more Moonglets."
        ]
    },
    {
        "name": "Mango Chutney",
        "ingredients": [
            "Amchur powder",
            "Sugar",
            "Chaat Masala",
            "Black pepper powder",
            "Roasted and crushed cumin seeds",
            "Black salt",
            "Chilli powder",
            "Salt",
            "Water"
        ],
        "instructions": [
            "Take water in a bowl.",
            "Add Amchur powder, sugar, Chaat Masala, black pepper powder, roasted and crushed cumin seeds, black salt, chilli powder, and salt to the water.",
            "Mix well to remove any lumps of Amchur powder.",
            "Cook the mixture on the stove until it comes to a quick boil. This process will thicken the chutney.",
            "Once it thickens, turn off the gas and let the chutney cool. It will thicken further as it cools.",
            "Note: If you have tamarind at home, you can use tamarind chutney as an alternative. However, tamarind chutney takes more time to cook."
        ]
    }
]