[
    {
        "name": "Black Chana Soup",
        "ingredients": [
            "Black Chana (Kala Chana) or Kabuli Chana or Green Chana",
            "Salt",
            "Water",
            "Onion",
            "Green Chillies",
            "Lemon Juice",
            "Tamarind Pulp",
            "Garam Masala"
        ],
        "instructions": [
            "Wash the chosen Chana (Black, Green, or Kabuli) a couple of times and soak it for at least 3 to 4 hours.",
            "Add the soaked Chana to a pressure cooker.",
            "Add Salt to flavour the Chana from within.",
            "Add a couple of cups of water to the pressure cooker.",
            "Cover and pressure cook for 3 to 4 whistles on low flame.",
            "Once the pressure settles down, check if the Chana is cooked by mashing one between your thumb and index finger. It should have no grit or grain.",
            "Separate the cooked Chana into two batches: 3/4 in one bowl and 1/4 in another bowl.",
            "Grind the smaller batch (1/4) into a fine puree.",
            "Add the Chana puree back into the stock, and add Salt as needed.",
            "Whisk the mixture well.",
            "Turn on the flame and allow the mixture to bubble and thicken.",
            "Chop an Onion and Green Chillies. Keep them ready.",
            "Prepare Tamarind Pulp and keep it ready alongside the boiled Chana, Garam Masala, chopped Onions, chopped Chillies, and Lemon Juice.",
            "Keep the Chana stock simmering on low heat, similar to a Korean hot pot, allowing you to scoop out the stock or soup and build it up as you serve.",
            "To serve: Add a couple of spoons of the boiled Chana to a bowl.",
            "Add some Tamarind Water.",
            "Add a generous pinch of Garam Masala.",
            "Add a generous spoon of Red Onions.",
            "Add Green Chillies as per your liking.",
            "Add Lemon Juice, ensuring no seeds are included.",
            "Finally, pour the thickened Chana Soup over the mixture in the bowl.",
            "Serve and enjoy the healthy Black Chana Soup, which is high in Protein, high in Fibre, low in Glycemic Index, and anti-inflammatory."
        ]
    }
]