[
    {
        "name": "Nutrella Soya Pav Bhaji",
        "ingredients": [
            "1 cup Nutrella Soya Granules",
            "1 cup Cauliflower",
            "1 Potato, diced",
            "1 Carrot, diced",
            "1 cup Green Peas",
            "2 cups Water (for pressure cooking)",
            "1 and a half tbsp Nutrella Sunflower Oil",
            "1 cube Butter",
            "1 big Onion, finely chopped",
            "1 Capsicum, finely chopped",
            "1 tbsp Garlic Chutney",
            "4 Tomatoes, finely chopped",
            "1 and a half tbsp Kashmiri Red Chilli Powder",
            "1 and a half tbsp Pav Bhaji Powder",
            "1 tsp Pav Bhaji Masala",
            "1 cup Water (for mixing later)",
            "Salt to taste",
            "Handful of Coriander Leaves (for garnish)"
        ],
        "instructions": [
            "Add 1 cup of Nutrella Soya Granules in boiling hot water. Mix it and boil. Drain it, rinse thoroughly with water, and then squeeze out all the extra moisture. The granules are now ready to use.",
            "In a pressure cooker, add 1 cup of Cauliflower, 1 diced Potato, 1 diced Carrot, 1 cup of Green Peas, and 2 cups of Water. Cover the cooker, turn on the flame, and let it pressure cook for 3-4 whistles.",
            "While the vegetables are pressure cooking, heat 1 and a half tbsp of Nutrella Sunflower Oil and 1 cube of Butter in a pan. Once the Butter starts to melt, add 1 big finely chopped Onion. Cook the Onions until they are soft.",
            "Add 1 finely chopped Capsicum to the pan. Next, add 1 tbsp of Garlic Chutney. Saute the Chutney for a few seconds.",
            "Add 4 finely chopped Tomatoes. Stir and let them cook until the Tomatoes soften completely.",
            "Once the pressure cooker cools down, open the lid and check the Vegetables. They should be nice and soft.",
            "Mash the Tomatoes slightly in the pan. Add 1 and a half tbsp of Kashmiri Red Chilli Powder, 1 and a half tbsp of Pav Bhaji Powder, and 1 tsp of Pav Bhaji Masala. Mix well and let it cook for a few seconds. (Tip: Use Patanjali Spices for full flavor.)",
            "Add the pressure-cooked Vegetables along with the Water from the cooker into the pan. Mash the Vegetables lightly.",
            "Add 1 cup of Water to the pan. Add Salt to taste and mix well.",
            "Add the prepared Soya Granules into the mixture. (Chef’s tip: Soya Granules do not have any unique taste of their own, so kids won't even know they're added.)",
            "Turn off the flame. Add a handful of Coriander Leaves and give it a final stir.",
            "Plate the Pav Bhaji. Garnish with some Coriander Leaves. The dish is now ready to serve."
        ]
    }
]