[
    {
        "name": "Hot and Sour Soup",
        "ingredients": [
            "French Beans",
            "Capsicum",
            "Cabbage",
            "Carrot",
            "Button Mushrooms (optional)",
            "Vegetable Oil",
            "Ginger",
            "Garlic",
            "Green Chilli (crushed)",
            "Water or Vegetable Stock",
            "Dark Soya Sauce",
            "White Vinegar",
            "Red Chilli Sauce",
            "Chicken Stock",
            "Salt",
            "Sugar",
            "Black Pepper",
            "Bean Sprouts",
            "Cornflour",
            "Cold Water",
            "Spring Greens",
            "Red Chilli Oil",
            "Spring Onions"
        ],
        "instructions": [
            "Cut the vegetables. Begin with French Beans, slicing them thinly.",
            "Slice the Capsicum thinly, discarding the seeds and membrane.",
            "Cut the Cabbage finely and slice the Carrot into thin juliennes.",
            "Slice the Button Mushrooms thinly (optional).",
            "Heat a wok on high flame and add a little bit of vegetable oil.",
            "Once the oil begins to smoke, lower the flame and add crushed Ginger, Garlic, and Green Chilli.",
            "Stir the mixture until it begins to sizzle.",
            "Add the sliced vegetables to the wok and give it a toss.",
            "Increase the flame and stir fry the vegetables on high flame for 30 seconds to a minute.",
            "Add Water or Vegetable Stock to the wok.",
            "Allow the soup to boil nicely on high flame for 2 to 3 minutes.",
            "Add Dark Soya Sauce for flavor and color.",
            "Add White Vinegar for the sour taste.",
            "Add Red Chilli Sauce for the heat and mix well.",
            "Add Chicken Stock at this stage.",
            "Add Salt, keeping in mind the salt content in the Soya Sauce.",
            "Add Sugar to balance the sourness and heat, not to make the soup sweet.",
            "Add a dash of Black Pepper and stir.",
            "Add Mushrooms and Bean Sprouts but do not overmix to avoid overcooking.",
            "Prepare a slurry by mixing Cornflour with Cold Water until lump-free.",
            "Add the slurry to the soup and mix well.",
            "Give the soup one final stir.",
            "Before turning off the flame, sprinkle Spring Greens and drizzle Red Chilli Oil generously.",
            "Garnish with additional Red Chilli Oil and Spring Onions before serving."
        ]
    }
]