[
    {
        "name": "Pulio Gray Rice (Tamarind Rice)",
        "ingredients": [
            "1 tsp Oil (for masala)",
            "2 tbsp Gram Dal (Chana Dal)",
            "1 tsp Mustard Seeds",
            "4 Kashmiri Chillies",
            "2 Spicy Red Chillies (or whichever chillies available at home)",
            "1.5 tsp Cumin Seeds",
            "1.5 tbsp Coriander Seeds",
            "1 tsp Methi Seeds",
            "1.5 tsp Black Sesame Seeds",
            "1 tsp Asafoetida",
            "2 tsp Oil (for rice)",
            "3 tbsp Gram Dal (Chana Dal)",
            "1.5 tbsp Urad Dal",
            "1.5 cups Peanuts",
            "2 Spicy Red Chillies",
            "A few Curry Leaves",
            "3 tbsp Tamarind Juice",
            "1 cup Water",
            "2 tbsp Prepared Masala",
            "1 tbsp Jaggery",
            "Salt (to taste)",
            "1 cup Boiled Rice"
        ],
        "instructions": [
            "Start by making the Pulio Gray Masala. Heat 1 tsp of Oil.",
            "Add 2 tbsp of Gram Dal (Chana Dal) and roast for a few seconds.",
            "Next, add 1 tsp of Mustard Seeds. Make sure to follow this order as each ingredient has its own cooking time.",
            "Add 4 Kashmiri Chillies and 2 Spicy Red Chillies (or whichever chillies available at home).",
            "Add 1.5 tsp of Cumin Seeds and 1.5 tbsp of Coriander Seeds.",
            "Add 1 tsp of Methi Seeds. Fry all the spices for a few seconds.",
            "Add 1.5 tsp of Black Sesame Seeds and 1 tsp of Asafoetida.",
            "Cook these ingredients till the Gram Dal changes color and is nicely toasted.",
            "Turn off the flame, let the mixture cool down completely, and grind it into a smooth powder to make the masala.",
            "Now, start making the rice. Heat 2 tsp of Oil.",
            "Once the oil is hot, add 3 tbsp of Gram Dal (Chana Dal). Fry properly.",
            "Add 1.5 tbsp of Urad Dal. Let the dals fry on low heat.",
            "After 2-3 minutes, once the Urad Dal starts catching a little color, add 1.5 cups of Peanuts. Fry these as well.",
            "Fry the Peanuts and Dals patiently on low heat. Do not increase the flame, or they will taste raw.",
            "Add 2 Spicy Red Chillies and fry them for a few seconds.",
            "Add a few Curry Leaves.",
            "Add 3 tbsp of Tamarind Juice and 1 cup of Water.",
            "Add 2 tbsp of the prepared masala. You can store this masala in the refrigerator for about 1 to 2 months.",
            "Add 1 tbsp of Jaggery and let all the ingredients cook together in the water.",
            "Make sure the Jaggery melts. Once the water has dried out a bit, add Salt to taste (enough for the rice as well).",
            "Toss in 1 cup of boiled Rice and mix well.",
            "The rice is ready. Plate it and enjoy the flavors of South India. It is great for lunch, tiffin, or any time you want to savor it."
        ]
    }
]