[
    {
        "name": "Dal Palak",
        "ingredients": [
            "Onions",
            "Green Chillies",
            "Ginger",
            "Garlic (optional)",
            "Tomatoes",
            "Ghee",
            "Cumin Seeds",
            "Asafoetida (Hing)",
            "Red Chilli Powder",
            "Turmeric Powder (Haldi)",
            "Roasted Coriander Seeds Powder",
            "Salt",
            "Fresh Spinach Leaves",
            "Cooked Lentils (Dal)"
        ],
        "instructions": [
            "Begin with cutting and chopping. Roughly chop some Onions.",
            "Chop some Green Chillies. Adjust the spice level to your preference.",
            "Chop some Ginger. You can add Garlic or a combination of Ginger and Garlic, but for this recipe, Ginger is preferred.",
            "Heat a deep pan and add Ghee. Allow it to heat on high flame.",
            "While the Ghee is heating, chop a Tomato.",
            "Once the Ghee is hot, add Cumin Seeds and allow them to splutter.",
            "Add Asafoetida (Hing).",
            "Immediately slide in the chopped Onions, Green Chillies, and Ginger.",
            "Saute on high flame until the Onions turn translucent and the raw flavor of Ginger goes away.",
            "Add Garlic (if using) and continue to saute until the Onions turn translucent.",
            "Add Asafoetida again.",
            "Add powdered spices: Red Chilli Powder, Turmeric Powder, and Roasted Coriander Seeds Powder. Mix well.",
            "Add the chopped Tomatoes and give everything a good stir.",
            "Add Salt. Ensure the salt is in check, especially if you’ve already added salt while cooking the lentils. Spinach also contains some natural salt, so adjust accordingly.",
            "Start shredding fresh Spinach leaves while the mixture cooks.",
            "Add the shredded Spinach to the pan. Though it seems like a lot of Spinach, it will shrink as it cooks, making the Dal Palak perfect.",
            "Boil the mixture on high flame for roughly a minute until the Spinach shrinks and combines with the Dal.",
            "The Dal Palak is ready. Transfer it to a bowl.",
            "Serve hot with steamed Rice. This dish is rich in protein and perfect for winters."
        ]
    }
]