[
    {
        "name": "Potato Lollipops",
        "ingredients": [
            "Boiled and peeled potatoes",
            "Chopped onion",
            "Chopped green chillies (or chilli flakes/black pepper as alternative)",
            "Red chilli powder",
            "Roasted cumin powder",
            "Roasted and crushed coriander seeds",
            "Chaat masala",
            "Lemon juice",
            "Ginger-garlic paste",
            "Refined flour",
            "Fresh breadcrumbs",
            "Salt",
            "Water",
            "Oil for frying"
        ],
        "instructions": [
            "Grate the boiled and peeled potatoes.",
            "Add chopped onion to the grated potatoes.",
            "Chop green chillies finely. Alternatively, use chilli flakes or black pepper if preferred. Add this to the grated potatoes.",
            "Add red chilli powder, roasted cumin powder, roasted and crushed coriander seeds, and chaat masala to the mixture.",
            "Add lemon juice and ginger-garlic paste to the mixture.",
            "To bind the mixture, add refined flour and fresh breadcrumbs.",
            "Mix all the ingredients well. Taste the mixture to check the salt level, especially if salt was added while boiling the potatoes. Add more salt if needed and mix again.",
            "Take lemon-sized or smaller portions of the potato mixture and roll them lightly into balls.",
            "Prepare a slurry by mixing refined flour, water, and a touch of salt. The slurry should be lump-free and have a consistency similar to double cream, not too thick or too thin.",
            "Take fresh breadcrumbs on a plate. Dip each potato ball into the slurry, coat it well, and then roll it in breadcrumbs. Press lightly to ensure the coating sticks.",
            "Repeat the process for all the potato balls.",
            "Freeze the crumbed potato balls for 15 minutes before frying. If storing for later, place them in an airtight container in the freezer, where they can be stored for up to a month.",
            "Heat oil on high flame for frying. Drop the frozen potato balls gently into the hot oil. Avoid overcrowding the pan to prevent breaking the balls.",
            "Do not stir immediately to prevent the balls from breaking. After a moment, give a light stir to ensure they don't stick to the bottom.",
            "Maintain high flame throughout frying. Lowering the flame can cause the balls to break or absorb too much oil.",
            "Fry until the balls are crisp and golden brown. Transfer them onto an absorbent tissue paper to remove excess oil.",
            "Before serving, perform one last step to ensure they are ready for the dinner table. (Specific step unspecified by chef)."
        ]
    }
]