[
    {
        "name": "Chickpeas Red Pepper Stew",
        "ingredients": [
            "1 Red Pepper (chopped into 4 pieces)",
            "1 Tomato",
            "1 small Onion (cut into 4 pieces)",
            "7-8 Garlic cloves",
            "4 Kashmiri Dry Red Chillies (deseeded)",
            "Olive Oil (for drizzling and cooking)",
            "1 cup Chickpeas (soaked overnight and drained)",
            "1 Potato (diced)",
            "8-10 Peppercorns",
            "2 pieces of Cinnamon",
            "4-5 Cloves",
            "1 Bay Leaf",
            "Salt (to taste)",
            "1 and a half cups Water",
            "1 tsp Curry Powder",
            "2 light green Chillies (sliced, not very spicy)",
            "1 tsp Sugar",
            "Finely chopped Parsley",
            "Yogurt (for serving)"
        ],
        "instructions": [
            "Preheat the oven to 180 degrees Celsius.",
            "Chop 1 Red Pepper into 4 pieces and place them in a tray.",
            "Add 1 Tomato, 1 small Onion (cut into 4 pieces), 7-8 Garlic cloves, and 4 deseeded Kashmiri Dry Red Chillies to the tray.",
            "Drizzle Olive Oil over the veggies.",
            "Place the tray in the preheated oven and grill the vegetables for around 20-25 minutes. Remove the chillies after 2 minutes as they cook quickly. (If you do not have dry chillies, you can add Paprika or Red Chilli Powder to the stew later.)",
            "While the vegetables are grilling, pressure cook the Chickpeas. Add 1 cup of overnight-soaked and drained Chickpeas, 1 diced Potato, 8-10 Peppercorns, 2 pieces of Cinnamon, 4-5 Cloves, 1 Bay Leaf, Salt to taste, and 1 and a half cups of Water to the pressure cooker.",
            "Pressure cook for 5-6 whistles on medium heat.",
            "Once done, open the pressure cooker to find the nicely cooked Chickpeas and Potatoes. Set them aside.",
            "After grilling, let the vegetables cool down. Remove the chillies after 2 minutes, and the other vegetables after 20-25 minutes.",
            "Peel the skin off the Red Pepper and keep 2 peeled pieces aside for later. Add the rest to a blender.",
            "Peel the skin off the Tomatoes and add them to the blender.",
            "Add the grilled Chillies, Onion, and Garlic to the blender and grind all these ingredients into a smooth paste.",
            "Heat 1 and a half tablespoons of Olive Oil in a pan.",
            "Saute the Red Pepper paste for 3-4 minutes.",
            "Add the Chickpeas, Potato, and the Water from the pressure cooker to the pan, removing the Bay Leaf.",
            "Stir the mixture well.",
            "Add in 1 tsp of Curry Powder, 2 light green Chillies (sliced), a little bit of Salt (keeping in mind the Chickpeas water already had Salt), and 1 tsp of Sugar.",
            "Mix well, cover, and let the stew simmer for 5 minutes.",
            "Add the reserved chopped Red Pepper pieces and finely chopped Parsley. Give it a final stir.",
            "The Chickpeas and Red Pepper Stew is ready. Serve it with a dollop of Yogurt on top, accompanied by steamed Rice or slices of Bread."
        ]
    }
]