[
    {
        "name": "Oats Crusted Paneer",
        "ingredients": [
            "Untoasted Gram Flour",
            "Red Chilli Powder",
            "Chaat Masala",
            "Salt",
            "Fresh Lemon Juice",
            "Water",
            "Paneer Pieces",
            "Oats",
            "Oil (for deep frying)"
        ],
        "instructions": [
            "Keeping oil to heat in a Kadhai.",
            "Quickly make the batter using untoasted Gram Flour in a deep bowl.",
            "Add Red Chilli Powder, depending on the heat that you prefer.",
            "Add Chaat Masala.",
            "Add Salt.",
            "Finally, for some additional time, fresh Lemon Juice. Collect all the seeds to avoid any untoward flavour and bite.",
            "Add some water and make a thick batter of coating consistency.",
            "Add in the pieces of Paneer and mix this well with light hands.",
            "Once this is done, crust these in Oats.",
            "Deep fry these till crisp and golden.",
            "Once these are fried and ready, draw this out of the oil and transfer these on an absorbent tissue paper.",
            "Your Oats Crusted Paneer is done and ready."
        ]
    },
    {
        "name": "Sriracha Paneer",
        "ingredients": [
            "Paneer Pieces",
            "Oil (for frying)",
            "Sriracha Sauce",
            "Tomato Ketchup",
            "Toasted White Sesame Seeds",
            "Black Sesame Seeds",
            "Finely Chopped Parsley",
            "Bamboo Sticks (for skewering)"
        ],
        "instructions": [
            "Fry the Paneer pieces in the same oil.",
            "Skewer the fried Paneer pieces using bamboo sticks.",
            "In a deep bowl, add Sriracha sauce.",
            "Add tangy and sweet Tomato Ketchup.",
            "Mix the sauces together.",
            "Naper the pieces of Paneer in this tangy, sweet, and spicy sauce.",
            "Place the coated Paneer on the same platter.",
            "Sprinkle toasted White Sesame Seeds along with Black Sesame Seeds and finely chopped Parsley.",
            "Your Sriracha Paneer, part of a platter of three, is done and ready."
        ]
    },
    {
        "name": "Korean Pancake with Paneer",
        "ingredients": [
            "Rice Flour",
            "Shredded White Cabbage",
            "Carrots",
            "Fine Dices of Paneer",
            "Parsley Leaves",
            "Soy Sauce",
            "Salt",
            "Freshly Cracked Black Pepper",
            "Baking Powder",
            "Water",
            "Vegetable Oil (for pan frying)"
        ],
        "instructions": [
            "Begin with Rice Flour.",
            "Add Shredded White Cabbage.",
            "Add Carrots.",
            "Add Fine Dices of Paneer.",
            "Add Parsley Leaves.",
            "Add Soy Sauce.",
            "Add Salt.",
            "Add freshly cracked Black Pepper.",
            "Add a little touch of Baking Powder.",
            "Give this a dry mix.",
            "Add in water a little at a time to make the batter.",
            "Heat regular Vegetable Oil in a pan and swirl it around.",
            "Drop in spoonfuls of the mixture into the pan.",
            "Carefully flip the pancakes and cook them on both sides.",
            "Once these are fried and ready, transfer them to a plate.",
            "Your Korean Pancake with Paneer is done and ready."
        ]
    }
]