[
    {
        "name": "Carrot Dhokla",
        "ingredients": [
            "Semolina",
            "Yogurt",
            "Water",
            "Salt",
            "Sugar",
            "Ginger and Green Chilli paste (Aadu Marchani paste in Gujarati)",
            "Grated Carrots",
            "Vegetable Oil (or Peanut Oil as an alternative)",
            "Fruit Salt",
            "Mustard Seeds",
            "Asafoetida",
            "Dried Red Chillies",
            "Sesame Seeds",
            "Curry Leaves",
            "Freshly Grated Coconut",
            "Freshly Cut Coriander Leaves"
        ],
        "instructions": [
            "First things first, soak the semolina in yogurt. Mix this and keep it aside for 10 minutes.",
            "Add a couple of tablespoons of water. Then, add some salt, sugar, and the Ginger and Green Chilli paste (Aadu Marchani paste).",
            "Add grated carrots (because it's Carrot Dhokla). Mix this well.",
            "Just before serving, add some water to the mixture.",
            "While this is steaming, add in some oil. In this case, regular vegetable oil is used, but by all means, peanut oil can also be added. Mix this well.",
            "Finally, add fruit salt and activate it with a tablespoon of water. Once the batter is mixed and ready, move immediately to the steaming process.",
            "Prepare the steaming apparatus. Add a little bit of oil to grease the steamer surface. Spread it evenly, ensuring the corners and edges are not left out. You can also use a brush for this.",
            "Pour the fluffy batter into the greased steamer.",
            "Light the flame and start adding water to the steamer. Place the batter inside the steamer (in this case, a makeshift one). Cover it and allow it to steam on high flame for 12 minutes.",
            "After 12 minutes, turn off the flame. Remove the lid immediately and let the steamed dhokla cool down completely before cutting and garnishing.",
            "Once the dhokla is cut and ready, the next step is to prepare the tempering.",
            "Heat some vegetable oil. Once the oil heats up, add mustard seeds, asafoetida, dried red chillies, sesame seeds, and curry leaves.",
            "Pour the tempering over the prepared dhokla.",
            "Top it with freshly grated coconut, freshly cut coriander leaves, and finally, more freshly grated carrots.",
            "With this, Carrot Dhokla is done and ready. Serve it to your family and friends. It can be made for breakfast, lunch, or as an evening snack. Enjoy!"
        ]
    }
]