[
    {
        "name": "Ragi Semiya Upma",
        "ingredients": [
            "Ragi Vermicelli (Ragi Semiya)",
            "Water (for soaking)",
            "Oil (for rubbing the steamer base)",
            "Ghee (or Oil/Olive Oil, as per preference)",
            "Mustard seeds",
            "Dry Red Chilli",
            "Split Chickpeas",
            "Split Lentils",
            "Peanuts (or Cashew Nuts, optional)",
            "Green Chilli",
            "Ginger",
            "Curry Leaves",
            "Onions (finely chopped)",
            "Beans (finely chopped)",
            "Carrot (finely chopped)",
            "Capsicum (finely chopped)",
            "Salt (as per taste)",
            "Boiled Fresh Green Peas",
            "Fresh Coriander",
            "Lemon"
        ],
        "instructions": [
            "Prepare the steamer by adding water and setting it up.",
            "Take the Ragi Vermicelli and soak it in water for 2-3 minutes. Be careful not to handle it too much at this stage to avoid breaking the vermicelli.",
            "Rub some oil on the base of the steamer to prevent sticking.",
            "Transfer the soaked Ragi Vermicelli to the steamer. Spread it evenly in the steamer.",
            "Steam the Ragi Vermicelli for 5 minutes. This will make it soft but still maintain its shape. Avoid overcooking to prevent it from becoming sticky or breaking.",
            "Once steamed, set the Ragi Vermicelli aside. Ensure it has cooked well and kept its shape.",
            "Heat Ghee (or Oil/Olive Oil) in a pan.",
            "Add Mustard seeds and let them pop. Lower the flame when they start popping.",
            "Add Dry Red Chilli, Split Chickpeas, and Split Lentils. Roast them lightly to enhance their nutty flavor and texture.",
            "Add Peanuts (or Cashew Nuts, if preferred). Roast until the Peanuts start splitting in the middle.",
            "Add finely chopped Green Chilli, Ginger, and Curry Leaves. Mix well.",
            "Add finely chopped vegetables: Onions, Beans, Carrot, and Capsicum. Cook on high heat to keep them slightly raw for a nice bite and texture. Avoid overcooking or mashing the vegetables.",
            "Season the vegetables with a little Salt and toss them well.",
            "Add the steamed Ragi Vermicelli to the pan. Add Salt as per taste and gently toss everything together.",
            "Towards the end, add boiled Fresh Green Peas, ensuring their color stays intact for better presentation.",
            "Mix gently using the 'lift and drop' method to avoid mashing the vermicelli. Ensure each grain of Ragi Semiya remains separate.",
            "Turn off the heat and add Fresh Coriander and a little Lemon juice. Mix gently.",
            "Plate the Ragi Semiya Upma and serve.",
            "Enjoy your healthy and delicious Ragi Semiya Upma, and don't forget to share your creation on social media and tag the chef!"
        ]
    }
]