[
    {
        "name": "Veg Hariyali",
        "ingredients": [
            "Vegetable Oil",
            "French Beans",
            "Cauliflower Florets",
            "Red Carrots",
            "Potatoes",
            "Green Peas (blanched)",
            "Fresh Garden Mint (picked, cleaned, washed)",
            "Fresh Coriander (hand-torn)",
            "Green Chillies",
            "Garlic",
            "Cumin",
            "Cinnamon Stick",
            "Cumin Seeds",
            "Fresh Onions",
            "Gram Flour",
            "Turmeric Powder",
            "Red Chilli Powder",
            "Coriander Seeds",
            "Garam Masala Powder",
            "Coriander Powder (optional)",
            "Tomatoes",
            "Salt"
        ],
        "instructions": [
            "First things first, light the flame.",
            "Begin with Vegetable Oil and add in the vegetables to sauté: French Beans, Cauliflower Florets, Red Carrots, and Potatoes.",
            "The idea is to bring in a couple of burnt spots onto the vegetables.",
            "At this stage, you may also wish to add in the Green Peas (blanched).",
            "Toss all of this, and with this, off goes the flame for now.",
            "A couple of vegetables are scotched and ready, keep this aside for now.",
            "Quickly move on to making the Hariyali paste for the gravy.",
            "Begin with fresh Garden Mint (picked, cleaned, washed and ready).",
            "Add fresh Coriander (hand-torn), a couple of Green Chillies, Garlic, and Cumin.",
            "Blend this into a smooth paste, along with the residual water from the blending jar.",
            "Heat the same pan again and add in Vegetable Oil.",
            "Add a Cinnamon Stick, Cumin Seeds, and fresh Onions.",
            "Once the Onions just begin to turn golden brown in colour, add Gram Flour.",
            "Ensure the Gram Flour roasts perfectly well so the raw flavour goes away.",
            "Add the spices: Turmeric Powder, Red Chilli Powder, and Coriander Seeds.",
            "At this stage, you may also wish to add Garam Masala Powder and Coriander Powder to accentuate the flavour of Coriander.",
            "Mix this well and immediately add in the Hariyali puree along with the residual water, a little at a time, stirring continuously.",
            "Allow this to roll boil.",
            "Now add in the vegetables, Tomatoes, and Salt.",
            "Allow the vegetables to cook on medium flame until they reach the desired doneness.",
            "Once done, off goes the flame, and your Veg Hariyali is ready to serve.",
            "This dish pairs well with Roti, Naan, Phulka, Puris, or Luchis.",
            "Make this for your family and friends, and replicate this restaurant-style recipe from your home kitchen."
        ]
    }
]