[
    {
        "name": "Chana Saag",
        "ingredients": [
            "4 cups of Chana leaves",
            "1 and a half cups of water",
            "1 and a half tablespoons of mustard oil (or any oil of your choice)",
            "1 teaspoon of cumin seeds",
            "1 onion, finely chopped",
            "1 tablespoon of finely chopped ginger",
            "6-8 cloves of garlic, finely chopped (use half for sautéing and half for tadka)",
            "4-5 green chillies, finely chopped",
            "2 tomatoes, pureed",
            "2 tablespoons of Sattu flour (or gram flour, roasted)",
            "Half teaspoon of red chilli powder",
            "Half teaspoon of coriander cumin seed powder",
            "Half teaspoon of garam masala powder",
            "A pinch of turmeric powder",
            "Salt to taste",
            "1 tablespoon of finely chopped garlic for tadka",
            "1 red chilli for tadka",
            "Extra mustard oil for tadka"
        ],
        "instructions": [
            "Clean the Chana leaves by breaking the soft stems. Do not just clean the leaves; you can take a little bit of the stem as well.",
            "Take about 4 cups of leaves and add around 1 and a half cups of water.",
            "Pressure cook the leaves for 3 whistles on high flame.",
            "Let the pressure cooker cool down completely, then open it. The leaves should be nicely cooked.",
            "Use the water from the pressure cooker and grind the cooked leaves into a smooth puree.",
            "Heat 1 and a half tablespoons of mustard oil (or oil of your choice) in a pan.",
            "Once the oil is hot, add 1 teaspoon of cumin seeds.",
            "Add 1 finely chopped onion and sauté till it becomes soft.",
            "Add 1 tablespoon of finely chopped ginger and half of the finely chopped garlic (reserve the other half for the tadka). Sauté for a few seconds.",
            "Add 4-5 green chillies, finely chopped.",
            "Add 2 tomatoes, pureed, and sauté until the tomato puree dries out.",
            "Add the puree of the Chana leaves to the sautéed tomato mixture and mix well.",
            "To give the dish extra body, add 2 tablespoons of Sattu flour (if using gram flour, roast it before adding).",
            "Add half a teaspoon each of red chilli powder, coriander cumin seed powder, garam masala powder, and a pinch of turmeric powder.",
            "Add salt to taste.",
            "Mix all the ingredients well, add some water, and let it cook for 3-4 minutes.",
            "Turn off the flame and plate the dish.",
            "For the tadka, heat some mustard oil, add 1 red chilli and 1 tablespoon of finely chopped garlic. Pour this over the Chana Saag.",
            "Serve the Chana Saag with any rotis of your choice, such as makkai di roti, missi roti, kulchas, parathas, or chapatis. Serve with some onions and chillies for added flavor."
        ]
    }
]