[
    {
        "name": "Shorgam Khichdi (Jowar Khichdi)",
        "ingredients": [
            "Jowar (Sorghum), dried and sun-dried",
            "Fresh Coconut",
            "Cloves of Garlic",
            "Curry Leaves",
            "Chillies (as per spice level)",
            "Fresh Coriander Leaves",
            "Onions",
            "Carrots",
            "Fresh Green Peas",
            "Ghee",
            "Mustard Seeds",
            "Asafoetida",
            "Turmeric Powder",
            "Pigeon Pea Lentils (Toor Dal)",
            "Moong Dal",
            "Buttermilk (1 cup for 1 cup of Jowar)",
            "Water (4 cups for 1 cup of Jowar)",
            "Salt"
        ],
        "instructions": [
            "Wash the dried Jowar (Sorghum) at least 2-3 times and soak it in warm water for at least 2 hours to allow it to bloom. This makes it easier to process.",
            "Transfer the bloomed Jowar into a blender jar. Grind it into a coarse powder without adding water. This improves its digestibility.",
            "Prepare a spice paste by coarsely grinding fresh Coconut, Garlic, Curry Leaves, Chillies (as per your spice level), and fresh Coriander Leaves. Set this aside.",
            "Chop the vegetables: roughly chop the Onions, dice the Carrots, and prepare the fresh Green Peas.",
            "Heat Ghee in a pressure cooker. Once heated, add Mustard Seeds, Asafoetida, and the chopped vegetables.",
            "Add Turmeric Powder and the prepared spice mix to the cooker.",
            "Add the Lentils: Toor Dal and Moong Dal.",
            "Add the soaked and ground Jowar to the mixture. Stir everything well.",
            "For the liquid, use a combination of Buttermilk and Water in a ratio of 1:5 (e.g., for 1 cup of Jowar, use 1 cup of Buttermilk and 4 cups of Water). Add the Buttermilk first, followed by Water. Stir the mixture well.",
            "Add Salt to taste, and stir again. You can adjust the Salt later if needed.",
            "Cover the pressure cooker and cook the Khichdi on medium flame for 3 whistles.",
            "Once done, turn off the flame and allow the pressure in the cooker to subside completely.",
            "Open the pressure cooker and serve the Khichdi hot (Garma Garam)."
        ]
    }
]