[
    {
        "name": "Soya Chilli Manchurian",
        "ingredients": [
            "Soya Nuggets",
            "Water",
            "Soya Sauce",
            "Salt",
            "Chopped Garlic",
            "Chopped Onion",
            "Green Chilli",
            "Ginger",
            "Green Onions",
            "Finely Chopped Coriander",
            "Lemon Juice (optional: Vinegar)",
            "Pepper Powder",
            "Corn Starch",
            "Flour",
            "Oil (for frying)",
            "Dry Red Chilies",
            "Capsicum",
            "Chilli Sauce (optional: Green Chilli Sauce)",
            "Tomato Ketchup",
            "Spring Onion",
            "Fresh Coriander"
        ],
        "instructions": [
            "Take the dried Soya Nuggets and put them in water.",
            "Add Soya Sauce, a little Salt, Chopped Garlic, Chopped Onion, Green Chilli, and a little Ginger to the water.",
            "Allow the Soya Nuggets to absorb all the flavors. The Nuggets will soften as the water reduces or you can strain it once softened.",
            "Once the water has almost dried up and the Soya Nuggets have absorbed the flavors, turn off the gas and take them out. Let them cool completely.",
            "After cooling, add Green Onions, finely Chopped Coriander, a little Salt, Green Chilli, Lemon Juice (or Vinegar), Pepper Powder, Corn Starch, and Flour to the Soya Nuggets.",
            "Mix everything well so that the flour coats the Soya Nuggets properly. As you mix, the water inside the Nuggets will come out and coat the flour evenly.",
            "Heat oil on high heat for frying. Carefully add the coated Soya Nuggets one by one to ensure they don’t stick to each other.",
            "Fry the Nuggets on high heat as they are already cooked from the inside. The outer batter just needs to be cooked for crunchiness. Once fried, take them out.",
            "For a healthier version, you can skip frying and directly move to sauce preparation, but frying allows the batter to soak up the sauce for maximum flavor.",
            "To prepare the Manchurian sauce, heat oil in a pan. Add Garlic and Ginger, keeping them slightly raw for a nice flavor.",
            "Add Chopped Onion, Green Chilies, and Dry Red Chilies. Toss them together. Add Capsicum (diced or chopped).",
            "Add Chilli Sauce (or Green Chilli Sauce), Tomato Ketchup, and a dash of Vinegar. Stir well.",
            "Add the Manchurian balls to the sauce. Add a little Salt and Spring Onion. Toss everything together.",
            "For a dry version, you can serve the dish at this stage as a snack or starter.",
            "For a saucy version, add some water to the pan. To thicken the sauce, dissolve Cornstarch in water and add it to the boiling sauce. Mix well and let it thicken.",
            "Adjust the consistency of the sauce as per your preference (thick or thin).",
            "Add extra Spring Onions and Chopped Fresh Coriander for garnish. Give it a final toss.",
            "Plate the Soya Chilli Manchurian and serve."
        ]
    }
]