[
    {
        "name": "Refreshing Summery Fruit Salad",
        "ingredients": [
            "Rocket Lettuce",
            "Mustard powder (optional, or Mustard paste)",
            "Chilli Flakes",
            "Freshly cracked Black Pepper",
            "Salt",
            "Honey",
            "Lemon Juice (or other citrus juice like Orange, Tangerine, Clementine, Pomero)",
            "Neutral Oil",
            "Watermelon",
            "Starfruit",
            "Dragon Fruit",
            "Steamed American Corn (optional: roasted for added flavor)",
            "Pomegranate Kernels",
            "English Cucumber (optional, suggested by chef)",
            "Parmesan Cheese (optional, suggested by chef)",
            "Other cheeses (optional, suggested by chef)"
        ],
        "instructions": [
            "Wash the Rocket Lettuce thoroughly in running gushing water.",
            "Snip the Rocket Lettuce leaves and reserve them in ice water for a couple of minutes. Do not keep them in ice water for too long to avoid frostbites.",
            "Drain the leaves and keep them fresh by placing them on a towel or napkin with a little water. These can also be stored in the refrigerator.",
            "Remove the stalk or spine of the lettuce, as it will not be used.",
            "Ensure not to tear the lettuce leaves too small to maintain a crisp bite, as they may wilt with the dressing and fruit juices.",
            "Prepare the dressing by adding Mustard powder (or paste), Chilli Flakes, Freshly cracked Black Pepper, Salt, Honey, and Lemon Juice in a bowl.",
            "Start whisking the dressing and slowly add Neutral Oil to create an emulsion.",
            "Transfer the dressing to a separate bowl and reserve it in the refrigerator until ready to toss the salad.",
            "Toss the cleaned Rocket Lettuce with the prepared dressing to form the base of the salad. Do not overdress the leaves to maintain their crispness.",
            "Carefully place the dressed Rocket Lettuce on a serving plate.",
            "Add pieces of Watermelon, Starfruit, and Dragon Fruit on top of the lettuce.",
            "Include Steamed American Corn (optionally roasted for an X-factor) and Pomegranate Kernels.",
            "Drizzle a little more dressing over the fruits.",
            "Optional additions suggested by the chef include English Cucumber and cheeses like Parmesan.",
            "Serve the salad as a light, breezy, and refreshing summery dish."
        ]
    }
]