[
    {
        "name": "Aloo Palak",
        "ingredients": [
            "1 onion",
            "2 dry red chillies",
            "10-12 garlic cloves (chopped and sliced)",
            "1 inch ginger (grated)",
            "2 desi tomatoes (not hybrid, roughly chopped)",
            "Green chillies (optional, finely chopped)",
            "1/2 kg spinach (desi palak, washed and cut)",
            "500 grams new winter potatoes (or any available potatoes, peeled and cut into chunks)",
            "1/2 teaspoon turmeric powder",
            "Kashmiri red chili powder (for color)",
            "Salt (to taste)",
            "Coriander powder (to taste)",
            "Garam masala (to taste)",
            "Dry fenugreek leaves (kasuri methi, to taste)",
            "Mustard oil (for cooking)",
            "Optional: Desi ghee (for finishing)",
            "Fresh coriander (for garnish)"
        ],
        "instructions": [
            "Prepare the ingredients: Roughly chop the tomatoes and onions. Grate the ginger. Chop the garlic into small pieces (some finely chopped, some sliced). Finely chop green chillies if using. Wash the spinach thoroughly 2-3 times to remove dirt and then cut it roughly after washing. Peel and cut the new winter potatoes into large chunks and keep them in water to prevent oxidation.",
            "Heat mustard oil in a pan until it starts smoking. This step ensures the pungency of the mustard oil is reduced.",
            "Add cumin seeds to the hot oil, followed by dry red chillies. Then add onions and sauté them slightly until they are just beginning to soften but not browned.",
            "Add chopped garlic to the onions and stir. Be careful not to add garlic first as it may burn and lose its flavor.",
            "Add potato chunks to the pan and roast them along with onions and garlic. Roast until the potatoes develop a slight color and the onions are lightly browned.",
            "Add grated ginger to the pan and continue roasting the mixture.",
            "Add turmeric powder and Kashmiri red chili powder at this stage for enhancing color. Stir well to coat the potatoes and onions evenly.",
            "Add roughly chopped green chillies (if using) and mix. Adding them now prevents the green chillies from burning.",
            "Add the roughly chopped tomatoes to the pan. Sprinkle salt and coriander powder for seasoning. Mix well.",
            "Cover the pan and let the mixture cook on low heat for 2-3 minutes. This will help the tomatoes soften and release their juices, which also allows the potatoes to start cooking further.",
            "Once the tomatoes have softened and the potatoes are nearly cooked, layer the spinach leaves on top of the potato mixture. Add garam masala and dry fenugreek leaves on top of the spinach.",
            "Do not stir the spinach immediately. Cover the pan and let it cook for 2-3 minutes. This allows the spinach to release its water and cook gently with the steam, preserving its flavors and avoiding the 'shock' from direct heat.",
            "After 2-3 minutes, open the lid and stir the mixture gently. Let it cook until the water released by the spinach evaporates completely and the oil separates from the mixture.",
            "Optional: Add a small amount of desi ghee at this stage to enhance the fragrance and flavor. Stir well.",
            "Check the potatoes to ensure they are fully cooked. Garnish with freshly chopped coriander.",
            "Serve hot with your choice of bread or rice."
        ]
    }
]