[
    {
        "name": "Halwai-Style Aloo Gobi (Low Oil)",
        "ingredients": [
            "1 medium cauliflower (cut into medium-sized florets, dried completely after washing)",
            "3 potatoes (cut into big cubes)",
            "3 desi tomatoes (or Bombay tomatoes if mango powder is unavailable)",
            "Ginger (for the puree)",
            "Coriander stalks (for the puree)",
            "2-3 green chillies (for the puree)",
            "1 teaspoon cumin seeds",
            "Salt (to taste)",
            "Turmeric powder (to taste)",
            "Kashmiri red chilli powder (to taste)",
            "Coriander powder (to taste)",
            "1/4 cup water",
            "1-2 tablespoons mustard oil",
            "A pinch of asafoetida",
            "Garam masala (to taste)",
            "Dry fenugreek leaves (to taste)",
            "Optional: Mango powder (if using Bombay tomatoes)",
            "Optional: Ginger and green chillies for garnish"
        ],
        "instructions": [
            "Cut the cauliflower into medium-sized florets and ensure they are completely dry after washing. This is crucial for proper cooking.",
            "Cut the potatoes into big cubes so that they cook evenly with the cauliflower.",
            "To prepare the base, blend desi tomatoes, ginger, coriander stalks, and 2-3 green chillies into a puree. If using Bombay tomatoes, add mango powder later for proper taste.",
            "Use a wok or a pan with a small bottom and a wide top to minimize the amount of oil used while ensuring even cooking.",
            "Heat mustard oil in the wok until it starts smoking. Add 1 teaspoon of cumin seeds and let them crackle.",
            "Add the potato cubes to the oil and coat them evenly. Roast the potatoes uncovered on medium-low flame until their outer surface starts to cook and develop texture.",
            "Once the potatoes are partially cooked, add the cauliflower florets along with salt and turmeric powder. Mix everything well to coat the cauliflower with a thin layer of oil.",
            "Continue roasting the cauliflower and potatoes uncovered on a medium-low flame. Do not cover them to avoid steam, which will prevent browning.",
            "In a separate pan, heat another tablespoon of mustard oil. Add a pinch of asafoetida to the hot oil.",
            "Add the prepared tomato puree to the pan. Season the puree with salt, turmeric powder, Kashmiri red chilli powder, and coriander powder. Cook the puree on low flame, stirring occasionally, until the flavors develop and the oil separates.",
            "Keep roasting the cauliflower and potatoes on a low flame in the other wok while the puree cooks. This process will take about 10 minutes.",
            "When the potatoes and cauliflower are well-roasted and slightly browned, combine them with the cooked tomato puree.",
            "Add 1/4 cup of water to the mixture, along with garam masala and dry fenugreek leaves. Mix everything well.",
            "Cover the wok and let the dish cook on a very low flame for 10-12 minutes. Stir the mixture once after 5 minutes, then cover it again and let it cook for another 7-8 minutes.",
            "Check to ensure that the cauliflower and potatoes are fully cooked (soft from the inside and roasted on the outside).",
            "If you want to make a gravy, add a little more water, ginger, and green chillies to the mixture and let it boil briefly.",
            "Enjoy your halwai-style aloo gobi made with very little oil!"
        ]
    }
]